
# Human-readable time 	Seconds
# 1 minutes 60 seconds
# 1 hour	3600 seconds
# 1 day	86400 seconds
#
# №1.	Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
# a.	до минуты: <s> сек;
# b.	до часа: <m> мин <s> сек;
# c.	до суток: <h> час <m> мин <s> сек;
# d.	* в остальных случаях: <d> дн <h> час <m> мин <s> сек.


duration = int(input('Введите продолжительность времени в секундах '))
print('Продолжительность', duration, 'сек')
# Для реализации алгоритма воспользуемся ветвлением и арефметическими операторами, операторами сравнения
# Сначала выводим результат a. до минуты: <s> сек, если False спускаемся в следующий блок
if duration < 60:
    s = duration
    print(s, 'сек')
# Выводим результат b. до часа: <m> мин <s> сек, если False спускаемся в следующий блок
elif 3600 > duration >= 60:
    s = duration % 60
    m = ((duration % 3600) // 60)
    print(m, 'мин', s, 'сек')
# Выводим результат c. до суток: <h> час <m> мин <s> сек, если False спускаемся в следующий блок
elif 86400 > duration >= 3600:
    s = duration % 60
    m = ((duration % 3600) // 60)
    h = duration // 3600
    print(h, 'час', m, 'мин', s, 'сек')
# Выводим d.	* в остальных случаях: <d> дн <h> час <m> мин <s> сек.
else:
    s = duration % 60
    m = ((duration % 3600) // 60)
    h = ((duration % 86400) // 3600)
    d = duration // 86400
    print(d, 'дн', h, 'час', m, 'мин', s, 'сек')
