
# №3.	Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов».
# Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

ending = ['процент', 'процента', 'процентов']
# Берем цикл for в range от 1 до 101 не включительно. (Это будут наши проценты от 1% до 100%)
for result in range(1, 101):
    # Выводим процент "-ов" от 11 до 14 включительно, если False спускаемся в следующий блок
    if 14 >= result >= 11:
        print(str(result), ending[2])
    # Выводим процент без окончания, если False спускаемся в следующий блок
    elif result % 10 == 1:
        print(str(result), ending[0])
    # Выводим процент "-а" с остатком от деления от 2 до 4 включительно, если False спускаемся в следующий блок
    elif 4 >= result % 10 >= 2:
        print(str(result), ending[1])
    # В остальных случаях выводим проценты "-ов". Конец.
    else:
        print(str(result), ending[2])
