# №5.	Создать вручную список, содержащий цены на товары (10–20 товаров), например:
# [57.8, 46.51, 97, ...]
# A.	Вывести на экран эти цены через запятую в одну строку,
# цена должна отображаться в виде <r> руб <kk> коп (например «5 руб 04 коп»).
# Подумать, как из цены получить рубли и копейки, как добавить нули,
# если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп или 00 коп).
# B.	Вывести цены, отсортированные по возрастанию, новый список не создавать
# (доказать, что объект списка после сортировки остался тот же).
# C.	Создать новый список, содержащий те же цены, но отсортированные по убыванию.
# D.	Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?

# A.
product_prices = [89.01, 99, 45.56, 45, 56.90, 34.07, 89.33, 34, 40.77, 48, 56.90, 31.09, 21, 54, 87.60]
print(id(product_prices))
for ind in product_prices:
    ind = str(ind)
    cost = ind.ljust(5, '0')
    if '.' in cost:
        print(f'{cost[0:2]} руб {cost[3:5]} коп', end=', ')
    else:
        print(f'{cost[0:2]} руб {cost[2:4]} коп', end=', ')
# B.
product_prices.sort()
print(f'ID {id(product_prices)} {product_prices}')
# C.
product_prices_r = sorted(product_prices, reverse=True)
print(f'ID изм. {id(product_prices_r)} - {product_prices_r}')
# D.
print(f'Пять самых ценных товаров {product_prices_r[0:5]}')
