# 1.	Написать функцию num_translate(), переводящую числительные от 0 до 10 c английского на русский язык.
# Например:
# >>> num_translate("one")
# "один"
# >>> num_translate("eight")
# "восемь"
# Если перевод сделать невозможно, вернуть None. Подумайте, как и где лучше хранить информацию,
# необходимую для перевода: какой тип данных выбрать, в теле функции или снаружи.
# 2.	*(вместо задачи 1) Доработать предыдущую функцию в num_translate_adv():
# реализовать корректную работу с числительными, начинающимися с заглавной буквы —
# результат тоже должен быть с заглавной.
# Например:
# >>> num_translate_adv("One")
# "Один"
# >>> num_translate_adv("two")
# "два"

# 3_1, 3_2

digit_translator = {
        'zero': 'ноль', 'one': 'один', 'two': 'два',
        'three': 'три', 'four': 'четыре', 'five': 'пять',
        'six': 'шесть', 'seven': 'семь', 'eight': 'восемь',
        'nine': 'девять', 'ten': 'десять',
    }


def num_translate(digit):
    """
    Функция возвращает перевод числительного от 0 до 10 c английского на русский язык

    :param digit: цифра на английском языке прописью
    :return: перевод цифры c английского на русский язык
    """
    if digit.istitle():
        return str(digit_translator.get(digit.lower())).title()
    return digit_translator.get(digit)


print(num_translate(input('Введите цифру прописью на английском языке от 0 до 10 ')))
